{
    "updated": "2026-02-22 14:22:40 UTC",
    "news": [
        {
            "title": "Scheduling in a changing world: Maximizing throughput with time-varying capacity",
            "description": "[RESEARCH] Algorithms & Theory",
            "url": "https://research.google/blog/scheduling-in-a-changing-world-maximizing-throughput-with-time-varying-capacity/"
        },
        {
            "title": "Export Your ML Model in ONNX Format",
            "description": "[MACHINELEARNINGMASTERY] When building machine learning models, training is only half the journey.",
            "url": "https://machinelearningmastery.com/export-your-ml-model-in-onnx-format/"
        },
        {
            "title": "Teaching AI to read a map",
            "description": "[RESEARCH] Machine Perception",
            "url": "https://research.google/blog/teaching-ai-to-read-a-map/"
        },
        {
            "title": "Beyond one-on-one: Authoring, simulating, and testing dynamic human-AI group conversations",
            "description": "[RESEARCH] Human-Computer Interaction and Visualization",
            "url": "https://research.google/blog/beyond-one-on-one-authoring-simulating-and-testing-dynamic-human-ai-group-conversations/"
        },
        {
            "title": "Repurposing Protein Folding Models for Generation with Latent Diffusion",
            "description": "[BAIR] PLAID is a multimodal generative model that simultaneously generates protein 1D sequence and 3D structure, by learning the latent space of protein folding models. The awarding of the 2024 Nobel Prize...",
            "url": "http://bair.berkeley.edu/blog/2025/04/08/plaid/"
        },
        {
            "title": "7 Advanced Feature Engineering Tricks Using LLM Embeddings",
            "description": "[MACHINELEARNINGMASTERY] You have mastered model.",
            "url": "https://machinelearningmastery.com/7-advanced-feature-engineering-tricks-using-llm-embeddings/"
        },
        {
            "title": "Whole-Body Conditioned Egocentric Video Prediction",
            "description": "[BAIR] &times; Predicting Ego-centric Video from human Actions (PEVA). Given past video frames and an action specifying a desired change in 3D pose, PEVA predicts the next video frame. Our results show...",
            "url": "http://bair.berkeley.edu/blog/2025/07/01/peva/"
        },
        {
            "title": "7 Important Considerations Before Deploying Agentic AI in Production",
            "description": "[MACHINELEARNINGMASTERY] The promise of agentic AI is compelling: autonomous systems that reason, plan, and execute complex tasks with minimal human intervention.",
            "url": "https://machinelearningmastery.com/7-important-considerations-before-deploying-agentic-ai-in-production/"
        },
        {
            "title": "Agent Evaluation: How to Test and Measure Agentic AI Performance",
            "description": "[MACHINELEARNINGMASTERY] AI agents that use tools, make decisions, and complete multi-step tasks aren't prototypes anymore.",
            "url": "https://machinelearningmastery.com/agent-evaluation-how-to-test-and-measure-agentic-ai-performance/"
        },
        {
            "title": "How AI tools can redefine universal design to increase accessibility",
            "description": "[RESEARCH] Education Innovation",
            "url": "https://research.google/blog/how-ai-agents-can-redefine-universal-design-to-increase-accessibility/"
        },
        {
            "title": "RL without TD learning",
            "description": "[BAIR] In this post, I’ll introduce a reinforcement learning (RL) algorithm based on an “alternative” paradigm: divide and conquer. Unlike traditional methods, this algorithm is not based on temporal...",
            "url": "http://bair.berkeley.edu/blog/2025/11/01/rl-without-td-learning/"
        },
        {
            "title": "How AI trained on birds is surfacing underwater mysteries",
            "description": "[RESEARCH] Climate & Sustainability",
            "url": "https://research.google/blog/how-ai-trained-on-birds-is-surfacing-underwater-mysteries/"
        },
        {
            "title": "A Beginner’s Reading List for Large Language Models for 2026",
            "description": "[MACHINELEARNINGMASTERY] &nbsp; The large language models (LLMs) hype wave shows no sign of fading anytime soon: after all, LLMs keep reinventing themselves at a rapid pace and transforming the industry as a whole.",
            "url": "https://machinelearningmastery.com/a-beginners-reading-list-for-large-language-models-for-2026/"
        },
        {
            "title": "What exactly does word2vec learn?",
            "description": "[BAIR] What exactly does word2vec learn, and how? Answering this question amounts to understanding representation learning in a minimal yet interesting language modeling task. Despite the fact that word2vec...",
            "url": "http://bair.berkeley.edu/blog/2025/09/01/qwem-word2vec-theory/"
        },
        {
            "title": "Defending against Prompt Injection with Structured Queries (StruQ) and Preference Optimization (SecAlign)",
            "description": "[BAIR] Recent advances in Large Language Models (LLMs) enable exciting LLM-integrated applications. However, as LLMs have improved, so have the attacks against them. Prompt injection attack is listed as the...",
            "url": "http://bair.berkeley.edu/blog/2025/04/11/prompt-injection-defense/"
        },
        {
            "title": "The great AI divide: While the West wrestles with tech winter of scepticism, the Global South seems to be experiencing a digital spring",
            "description": "[THE ECONOMIC TIMES] As the AI Impact Summit 2026 in New Delhi concludes, a clear divide has emerged in how regions view artificial intelligence. While many Western countries show caution, much of the Global South,...",
            "url": "https://economictimes.indiatimes.com/ai/ai-insights/the-great-ai-divide-while-the-west-wrestles-with-tech-winter-of-scepticism-the-global-south-seems-to-be-experiencing-a-digital-spring/articleshow/128663259.cms"
        },
        {
            "title": "IMD issues yellow alert in 3 Kerala districts; heavy rain likely",
            "description": "[MALAYALA MANORAMA] The districts under yellow alert are Pathanamthitta, Kottayam and Idukki..Kerala yellow alert, Thiruvananthapuram weather, heavy rainfall warning Kerala, isolated heavy showers Pathanamthitta,...",
            "url": "https://www.onmanorama.com/news/kerala/2026/02/22/kerala-weather-imd-rain-live.html"
        },
        {
            "title": "JEFF PRESTRIDGE: You'd have TRIPLED your money if you'd bought this sky-rocketing fund I tipped three years ago... This is where to invest next for stellar returns",
            "description": "[DAILY MAIL ONLINE] Move over artificial intelligence, it's time for investors to consider exposure to space technology in order to fuel their investment portfolios, Isas and pensions.",
            "url": "https://www.dailymail.co.uk/money/article-15580545/JEFF-PRESTRIDGE-TRIPLED-money-sky-rocketing-fund-tipped-stellar-returns.html"
        },
        {
            "title": "India and Brazil set $30 billion trade target by 2030; sign mineral, rare earth pact",
            "description": "[ZEE NEWS] Brazilian President Lula noted that India’s strengths in information technology, artificial intelligence, biotechnology and the space sector have opened up fresh avenues for collaboration.",
            "url": "https://zeenews.india.com/india/india-and-brazil-set-30-billion-trade-target-by-2030-sign-mineral-rare-earth-pact-3019402.html"
        },
        {
            "title": "Tavleen Singh writes: Artificial intelligence, real hubris",
            "description": "[THE INDIAN EXPRESS] If AI can do what humans have failed to, then we need to embrace it with open arms and ensure that it spreads rapidly across rural India where it is needed more than in the cities. But before that...",
            "url": "https://indianexpress.com/article/opinion/columns/tavleen-singh-writes-artificial-intelligence-real-hubris-10545033/"
        },
        {
            "title": "At AI Summit, India tries to find a way between the US and China",
            "description": "[THE ECONOMIC TIMES] India is positioning itself as a mediator in the global artificial intelligence race dominated by the United States and China, offering support to developing nations that lack strong AI capabilities....",
            "url": "https://economictimes.indiatimes.com/ai/ai-insights/at-ai-summit-india-tries-to-find-a-way-between-the-us-and-china/articleshow/128661764.cms"
        },
        {
            "title": "China Defies Global ‘AI Scare Trade’ as Investors Chase Winners",
            "description": "[LIVEMINT] US markets are gripped by the “AI scare trade,” with investors selling software firms and wealth managers on concern that rapid advances in artificial intelligence will erode established business...",
            "url": "https://www.livemint.com/market/china-defies-global-ai-scare-trade-as-investors-chase-winners-11771720102085.html"
        },
        {
            "title": "Federal AI minister raises concerns over OpenAI safety protocols after Tumbler Ridge mass shooting",
            "description": "[CBC.CA] Canada’s artificial intelligence minister says he is raising concerns with OpenAI and other such platforms about their safety protocols, after the tech company confirmed that the account of the...",
            "url": "https://www.cbc.ca/news/canada/british-columbia/federal-ai-minister-raises-concerns-over-openai-tumbler-ridge-shooting-9.7101279"
        },
        {
            "title": "Take Solutions adopts Anthropic's AI assistant Claude",
            "description": "[DAILY EXCELSIOR] NEW DELHI, Feb 21: Global AI-driven healthcare company Take Solutions on Saturday said it has adopted Anthropic’s artificial intelligence assistant, Claude. The company, in an exchange filing, said...",
            "url": "https://www.dailyexcelsior.com/take-solutions-adopts-anthropics-ai-assistant-claude/"
        },
        {
            "title": "US military airlifts small reactor as Trump pushes to quickly deploy nuclear power",
            "description": "[DAILY EXCELSIOR] HILL AIR FORCE BASE (US), Feb 21: The Pentagon and the Energy Department for the first time airlifted a small nuclear reactor from California to Utah, demonstrating what they say is US potential to...",
            "url": "https://www.dailyexcelsior.com/us-military-airlifts-small-reactor-as-trump-pushes-to-quickly-deploy-nuclear-power/"
        }
    ]
}