{
    "updated": "2026-02-18 08:40:28 UTC",
    "news": [
        {
            "title": "Scheduling in a changing world: Maximizing throughput with time-varying capacity",
            "description": "[RESEARCH] Algorithms & Theory",
            "url": "https://research.google/blog/scheduling-in-a-changing-world-maximizing-throughput-with-time-varying-capacity/"
        },
        {
            "title": "Export Your ML Model in ONNX Format",
            "description": "[MACHINELEARNINGMASTERY] When building machine learning models, training is only half the journey.",
            "url": "https://machinelearningmastery.com/export-your-ml-model-in-onnx-format/"
        },
        {
            "title": "Teaching AI to read a map",
            "description": "[RESEARCH] Machine Perception",
            "url": "https://research.google/blog/teaching-ai-to-read-a-map/"
        },
        {
            "title": "Beyond one-on-one: Authoring, simulating, and testing dynamic human-AI group conversations",
            "description": "[RESEARCH] Human-Computer Interaction and Visualization",
            "url": "https://research.google/blog/beyond-one-on-one-authoring-simulating-and-testing-dynamic-human-ai-group-conversations/"
        },
        {
            "title": "Repurposing Protein Folding Models for Generation with Latent Diffusion",
            "description": "[BAIR] PLAID is a multimodal generative model that simultaneously generates protein 1D sequence and 3D structure, by learning the latent space of protein folding models. The awarding of the 2024 Nobel Prize...",
            "url": "http://bair.berkeley.edu/blog/2025/04/08/plaid/"
        },
        {
            "title": "7 Advanced Feature Engineering Tricks Using LLM Embeddings",
            "description": "[MACHINELEARNINGMASTERY] You have mastered model.",
            "url": "https://machinelearningmastery.com/7-advanced-feature-engineering-tricks-using-llm-embeddings/"
        },
        {
            "title": "Whole-Body Conditioned Egocentric Video Prediction",
            "description": "[BAIR] &times; Predicting Ego-centric Video from human Actions (PEVA). Given past video frames and an action specifying a desired change in 3D pose, PEVA predicts the next video frame. Our results show...",
            "url": "http://bair.berkeley.edu/blog/2025/07/01/peva/"
        },
        {
            "title": "7 Important Considerations Before Deploying Agentic AI in Production",
            "description": "[MACHINELEARNINGMASTERY] The promise of agentic AI is compelling: autonomous systems that reason, plan, and execute complex tasks with minimal human intervention.",
            "url": "https://machinelearningmastery.com/7-important-considerations-before-deploying-agentic-ai-in-production/"
        },
        {
            "title": "Agent Evaluation: How to Test and Measure Agentic AI Performance",
            "description": "[MACHINELEARNINGMASTERY] AI agents that use tools, make decisions, and complete multi-step tasks aren't prototypes anymore.",
            "url": "https://machinelearningmastery.com/agent-evaluation-how-to-test-and-measure-agentic-ai-performance/"
        },
        {
            "title": "How AI tools can redefine universal design to increase accessibility",
            "description": "[RESEARCH] Education Innovation",
            "url": "https://research.google/blog/how-ai-agents-can-redefine-universal-design-to-increase-accessibility/"
        },
        {
            "title": "RL without TD learning",
            "description": "[BAIR] In this post, I’ll introduce a reinforcement learning (RL) algorithm based on an “alternative” paradigm: divide and conquer. Unlike traditional methods, this algorithm is not based on temporal...",
            "url": "http://bair.berkeley.edu/blog/2025/11/01/rl-without-td-learning/"
        },
        {
            "title": "How AI trained on birds is surfacing underwater mysteries",
            "description": "[RESEARCH] Climate & Sustainability",
            "url": "https://research.google/blog/how-ai-trained-on-birds-is-surfacing-underwater-mysteries/"
        },
        {
            "title": "A Beginner’s Reading List for Large Language Models for 2026",
            "description": "[MACHINELEARNINGMASTERY] &nbsp; The large language models (LLMs) hype wave shows no sign of fading anytime soon: after all, LLMs keep reinventing themselves at a rapid pace and transforming the industry as a whole.",
            "url": "https://machinelearningmastery.com/a-beginners-reading-list-for-large-language-models-for-2026/"
        },
        {
            "title": "What exactly does word2vec learn?",
            "description": "[BAIR] What exactly does word2vec learn, and how? Answering this question amounts to understanding representation learning in a minimal yet interesting language modeling task. Despite the fact that word2vec...",
            "url": "http://bair.berkeley.edu/blog/2025/09/01/qwem-word2vec-theory/"
        },
        {
            "title": "Defending against Prompt Injection with Structured Queries (StruQ) and Preference Optimization (SecAlign)",
            "description": "[BAIR] Recent advances in Large Language Models (LLMs) enable exciting LLM-integrated applications. However, as LLMs have improved, so have the attacks against them. Prompt injection attack is listed as the...",
            "url": "http://bair.berkeley.edu/blog/2025/04/11/prompt-injection-defense/"
        },
        {
            "title": "Fed's Daly says US central bank still needs to get inflation down",
            "description": "[REUTERS] San Francisco Federal Reserve President Mary Daly on Tuesday said the U.S. central bank still needs to get inflation down, and that while artificial intelligence potentially helps in that regard, the...",
            "url": "https://www.reuters.com/business/feds-daly-says-us-central-bank-still-needs-get-inflation-down-2026-02-17/"
        },
        {
            "title": "SC flags lawyers using AI to draft petitions, cites non",
            "description": "[THE TRIBUNE] Shocked by a non-existent judgment 'Mercy versus Mankind' cited in a petition, the Supreme Court on Tuesday expressed serious concern over the growing trend of some lawyers filing petitions drafted...",
            "url": "https://www.tribuneindia.com/news/india/sc-flags-lawyers-using-ai-to-draft-petitions-cites-non-existent-verdicts/"
        },
        {
            "title": "Meta Patented LLM That Would Post For Users After They Die",
            "description": "[MASHABLE INDIA] The company says its just a concept, and doesn't plan to advance the idea.",
            "url": "https://in.mashable.com/tech/106002/meta-patented-llm-that-would-post-for-users-after-they-die"
        },
        {
            "title": "HII Teams with Path Robotics to Integrate Physical AI into Manned and Unmanned Shipbuilding",
            "description": "[THE MANILA TIMES] COLUMBUS, Ohio, Feb. 17, 2026 (GLOBE NEWSWIRE) -- HII (NYSE: HII) and Path Robotics signed a memorandum of understanding (MOU) today to explore the integration of Path’s physical artificial...",
            "url": "https://www.manilatimes.net/2026/02/18/tmt-newswire/globenewswire/hii-teams-with-path-robotics-to-integrate-physical-ai-into-manned-and-unmanned-shipbuilding/2279866"
        },
        {
            "title": "How Mass Texting Platforms Are Evolving in the Age of AI",
            "description": "[TECHBULLION] Mass texting has long been a powerful communication tool for businesses, nonprofits, and organizations looking to reach large audiences quickly. But in the age of artificial intelligence, these...",
            "url": "https://techbullion.com/how-mass-texting-platforms-are-evolving-in-the-age-of-ai/"
        },
        {
            "title": "India eyes $200 bil in data center investments as it ramps up its AI hub ambitions",
            "description": "[JAPAN TODAY] India is hoping to garner as much as $200 billion in investments for data centers over the next few years as it scales up its ambitions to become a hub for artificial intelligence, the country’s...",
            "url": "https://japantoday.com/category/tech/india-eyes-200b-in-data-center-investments-as-it-ramps-up-its-ai-hub-ambitions"
        },
        {
            "title": "Tech and Financial Stocks Drive Modest Gains on Wall Street Amid AI Concerns",
            "description": "[DEVDISCOURSE] U.S. stocks saw modest gains as technology shares rebounded and financial stocks provided support. Artificial intelligence concerns had previously triggered selloffs. The Dow Jones and S&P 500...",
            "url": "https://www.devdiscourse.com/article/technology/3808685-tech-and-financial-stocks-drive-modest-gains-on-wall-street-amid-ai-concerns"
        },
        {
            "title": "Fed must dig deep on AI impact to make right rate calls ahead, Daly says",
            "description": "[REUTERS] The Federal Reserve must dig deep on the data to assess whether artificial intelligence is boosting productivity growth and enabling faster economic growth without igniting inflation or requiring the...",
            "url": "https://www.reuters.com/business/fed-must-dig-deep-ai-impact-make-right-rate-calls-ahead-daly-says-2026-02-17/"
        },
        {
            "title": "New AI-based approach detects fatty deposits inside coronary arteries using OCT images",
            "description": "[NEWS-MEDICAL.NET] Researchers have developed a new artificial intelligence-based approach for detecting fatty deposits inside coronary arteries using optical coherence tomography (OCT) images.",
            "url": "https://www.news-medical.net/news/20260217/New-AI-based-approach-detects-fatty-deposits-inside-coronary-arteries-using-OCT-images.aspx"
        },
        {
            "title": "India's tougher AI social media rules spark censorship fears",
            "description": "[JAPAN TODAY] India has tightened rules governing the use of artificial intelligence on social media to combat a flood of disinformation, but also prompting warnings of censorship and an erosion of digital...",
            "url": "https://japantoday.com/category/tech/india%27s-tougher-ai-social-media-rules-spark-censorship-fears"
        }
    ]
}