{
    "updated": "2026-02-18 14:41:10 UTC",
    "news": [
        {
            "title": "Scheduling in a changing world: Maximizing throughput with time-varying capacity",
            "description": "[RESEARCH] Algorithms & Theory",
            "url": "https://research.google/blog/scheduling-in-a-changing-world-maximizing-throughput-with-time-varying-capacity/"
        },
        {
            "title": "Export Your ML Model in ONNX Format",
            "description": "[MACHINELEARNINGMASTERY] When building machine learning models, training is only half the journey.",
            "url": "https://machinelearningmastery.com/export-your-ml-model-in-onnx-format/"
        },
        {
            "title": "Teaching AI to read a map",
            "description": "[RESEARCH] Machine Perception",
            "url": "https://research.google/blog/teaching-ai-to-read-a-map/"
        },
        {
            "title": "Beyond one-on-one: Authoring, simulating, and testing dynamic human-AI group conversations",
            "description": "[RESEARCH] Human-Computer Interaction and Visualization",
            "url": "https://research.google/blog/beyond-one-on-one-authoring-simulating-and-testing-dynamic-human-ai-group-conversations/"
        },
        {
            "title": "Repurposing Protein Folding Models for Generation with Latent Diffusion",
            "description": "[BAIR] PLAID is a multimodal generative model that simultaneously generates protein 1D sequence and 3D structure, by learning the latent space of protein folding models. The awarding of the 2024 Nobel Prize...",
            "url": "http://bair.berkeley.edu/blog/2025/04/08/plaid/"
        },
        {
            "title": "7 Advanced Feature Engineering Tricks Using LLM Embeddings",
            "description": "[MACHINELEARNINGMASTERY] You have mastered model.",
            "url": "https://machinelearningmastery.com/7-advanced-feature-engineering-tricks-using-llm-embeddings/"
        },
        {
            "title": "Whole-Body Conditioned Egocentric Video Prediction",
            "description": "[BAIR] &times; Predicting Ego-centric Video from human Actions (PEVA). Given past video frames and an action specifying a desired change in 3D pose, PEVA predicts the next video frame. Our results show...",
            "url": "http://bair.berkeley.edu/blog/2025/07/01/peva/"
        },
        {
            "title": "7 Important Considerations Before Deploying Agentic AI in Production",
            "description": "[MACHINELEARNINGMASTERY] The promise of agentic AI is compelling: autonomous systems that reason, plan, and execute complex tasks with minimal human intervention.",
            "url": "https://machinelearningmastery.com/7-important-considerations-before-deploying-agentic-ai-in-production/"
        },
        {
            "title": "Agent Evaluation: How to Test and Measure Agentic AI Performance",
            "description": "[MACHINELEARNINGMASTERY] AI agents that use tools, make decisions, and complete multi-step tasks aren't prototypes anymore.",
            "url": "https://machinelearningmastery.com/agent-evaluation-how-to-test-and-measure-agentic-ai-performance/"
        },
        {
            "title": "How AI tools can redefine universal design to increase accessibility",
            "description": "[RESEARCH] Education Innovation",
            "url": "https://research.google/blog/how-ai-agents-can-redefine-universal-design-to-increase-accessibility/"
        },
        {
            "title": "RL without TD learning",
            "description": "[BAIR] In this post, I’ll introduce a reinforcement learning (RL) algorithm based on an “alternative” paradigm: divide and conquer. Unlike traditional methods, this algorithm is not based on temporal...",
            "url": "http://bair.berkeley.edu/blog/2025/11/01/rl-without-td-learning/"
        },
        {
            "title": "How AI trained on birds is surfacing underwater mysteries",
            "description": "[RESEARCH] Climate & Sustainability",
            "url": "https://research.google/blog/how-ai-trained-on-birds-is-surfacing-underwater-mysteries/"
        },
        {
            "title": "A Beginner’s Reading List for Large Language Models for 2026",
            "description": "[MACHINELEARNINGMASTERY] &nbsp; The large language models (LLMs) hype wave shows no sign of fading anytime soon: after all, LLMs keep reinventing themselves at a rapid pace and transforming the industry as a whole.",
            "url": "https://machinelearningmastery.com/a-beginners-reading-list-for-large-language-models-for-2026/"
        },
        {
            "title": "What exactly does word2vec learn?",
            "description": "[BAIR] What exactly does word2vec learn, and how? Answering this question amounts to understanding representation learning in a minimal yet interesting language modeling task. Despite the fact that word2vec...",
            "url": "http://bair.berkeley.edu/blog/2025/09/01/qwem-word2vec-theory/"
        },
        {
            "title": "Defending against Prompt Injection with Structured Queries (StruQ) and Preference Optimization (SecAlign)",
            "description": "[BAIR] Recent advances in Large Language Models (LLMs) enable exciting LLM-integrated applications. However, as LLMs have improved, so have the attacks against them. Prompt injection attack is listed as the...",
            "url": "http://bair.berkeley.edu/blog/2025/04/11/prompt-injection-defense/"
        },
        {
            "title": "CHAT and WTAI: Two AI ETFs Offering High Dividend Yields",
            "description": "[MARKETS INSIDER] Artificial intelligence (AI) has become one of the key themes in the market, but not all AI ETFs are built the same. While many focus mainly on ...",
            "url": "https://markets.businessinsider.com/news/stocks/chat-and-wtai-two-ai-etfs-offering-high-dividend-yields-1035837867"
        },
        {
            "title": "India among key hubs for AI innovation, company deepening India partnerships: Nvidia",
            "description": "[THE ECONOMIC TIMES] Nvidia's diversity of partnerships is critical as AI is not a single product, nor a lone one-off breakthrough, he said, likening Artificial Intelligence to a five-layer cake spanning energy (as the...",
            "url": "https://economictimes.indiatimes.com/tech/technology/india-among-key-hubs-for-ai-innovation-company-deepening-india-partnerships-nvidia/articleshow/128488604.cms"
        },
        {
            "title": "Intel Looks for “One in Two” PCs to be AI-Driven; Intel Stock (NASDAQ:INTC) Slips Regardless",
            "description": "[MARKETS INSIDER] The notion of an artificial intelligence (AI) PC has caught some imaginations, but has not made a lot of headway in the market. But chip stock I...",
            "url": "https://markets.businessinsider.com/news/stocks/intel-looks-for-one-in-two-pcs-to-be-ai-driven-intel-stock-nasdaq-intc-slips-regardless-1035839245"
        },
        {
            "title": "Asia stocks rise despite lingering AI worries, oil down after US-Iran talks",
            "description": "[REUTERS] Asian stocks pushed higher on Wednesday despite the renewed artificial intelligence worries gripping international markets, while oil prices were under pressure after Iran touted progress in nuclear...",
            "url": "https://www.reuters.com/world/china/global-markets-global-markets-2026-02-18/"
        },
        {
            "title": "Asia stocks rise despite lingering AI worries, oil down after US-Iran talks",
            "description": "[MARKETSCREENER] Asian stocks pushed higher on Wednesday despite the renewed artificial intelligence worries gripping international markets, while oil prices were under pressure after Iran touted progress in...",
            "url": "https://www.marketscreener.com/news/asia-stocks-rise-despite-lingering-ai-worries-oil-down-after-us-iran-talks-ce7e5dd9d18cf32d"
        },
        {
            "title": "5 Smart Ways to Diversify Your Portfolio in 2026",
            "description": "[WDIV CLICKONDETROIT] Portfolio diversification might sound like a chore, but it’s worth the effort in 2026, given how dominant the artificial intelligence trade was last year.",
            "url": "https://www.clickondetroit.com/news/2026/02/18/5-smart-ways-to-diversify-your-portfolio-in-2026/"
        },
        {
            "title": "Who are the architects of AI, and what are the ties that bind them?",
            "description": "[THE INDIAN EXPRESS] The world’s most consequential artificial intelligence research is being conducted by a strikingly small circle of scientists who studied mostly under the same mentors, taught in the same rooms and...",
            "url": "https://indianexpress.com/article/explained/who-are-the-architects-of-ai-and-what-are-the-ties-that-bind-them-10537737/"
        },
        {
            "title": "Four deaths in Idukki house fire: Case unsolved even after 8 months, natives to resume protest",
            "description": "[MALAYALA MANORAMA] Chemical analysis detected traces of a substance believed to be used by the Forest Department, further deepening the mystery..Idukki house fire mystery, Kombodinjhal fire investigation, unsolved...",
            "url": "https://www.onmanorama.com/news/kerala/2026/02/18/four-member-family-killed-in-idukki-house-fire-police-fail-to-solve-case.html"
        },
        {
            "title": "AI Impact Summit 2026: Can Artificial Intelligence Democratise Creativity Without Undermining Artists?",
            "description": "[OUTLOOK INDIA] Panelists call for clearer legal frameworks around fair use, consent and remuneration, urging policy-makers to treat AI as a collective project shaped by ethical and economic accountability.",
            "url": "https://www.outlookindia.com/national/ai-impact-summit-2026-can-artificial-intelligence-democratise-creativity-without-undermining-artists"
        },
        {
            "title": "California builds AI oversight unit and presses on xAI investigation",
            "description": "[THE STAR] SAN FRANCISCO, Feb 17 (Reuters) - California Attorney General Rob Bonta is building an artificial ⁠intelligence accountability program as his office probes Elon Musk's xAI over the generation of...",
            "url": "https://www.thestar.com.my/tech/tech-news/2026/02/18/california-builds-ai-oversight-unit-and-presses-on-xai-investigation"
        }
    ]
}