{
    "updated": "2026-02-19 01:53:32 UTC",
    "news": [
        {
            "title": "Scheduling in a changing world: Maximizing throughput with time-varying capacity",
            "description": "[RESEARCH] Algorithms & Theory",
            "url": "https://research.google/blog/scheduling-in-a-changing-world-maximizing-throughput-with-time-varying-capacity/"
        },
        {
            "title": "Export Your ML Model in ONNX Format",
            "description": "[MACHINELEARNINGMASTERY] When building machine learning models, training is only half the journey.",
            "url": "https://machinelearningmastery.com/export-your-ml-model-in-onnx-format/"
        },
        {
            "title": "Teaching AI to read a map",
            "description": "[RESEARCH] Machine Perception",
            "url": "https://research.google/blog/teaching-ai-to-read-a-map/"
        },
        {
            "title": "Beyond one-on-one: Authoring, simulating, and testing dynamic human-AI group conversations",
            "description": "[RESEARCH] Human-Computer Interaction and Visualization",
            "url": "https://research.google/blog/beyond-one-on-one-authoring-simulating-and-testing-dynamic-human-ai-group-conversations/"
        },
        {
            "title": "Repurposing Protein Folding Models for Generation with Latent Diffusion",
            "description": "[BAIR] PLAID is a multimodal generative model that simultaneously generates protein 1D sequence and 3D structure, by learning the latent space of protein folding models. The awarding of the 2024 Nobel Prize...",
            "url": "http://bair.berkeley.edu/blog/2025/04/08/plaid/"
        },
        {
            "title": "7 Advanced Feature Engineering Tricks Using LLM Embeddings",
            "description": "[MACHINELEARNINGMASTERY] You have mastered model.",
            "url": "https://machinelearningmastery.com/7-advanced-feature-engineering-tricks-using-llm-embeddings/"
        },
        {
            "title": "Whole-Body Conditioned Egocentric Video Prediction",
            "description": "[BAIR] &times; Predicting Ego-centric Video from human Actions (PEVA). Given past video frames and an action specifying a desired change in 3D pose, PEVA predicts the next video frame. Our results show...",
            "url": "http://bair.berkeley.edu/blog/2025/07/01/peva/"
        },
        {
            "title": "7 Important Considerations Before Deploying Agentic AI in Production",
            "description": "[MACHINELEARNINGMASTERY] The promise of agentic AI is compelling: autonomous systems that reason, plan, and execute complex tasks with minimal human intervention.",
            "url": "https://machinelearningmastery.com/7-important-considerations-before-deploying-agentic-ai-in-production/"
        },
        {
            "title": "Agent Evaluation: How to Test and Measure Agentic AI Performance",
            "description": "[MACHINELEARNINGMASTERY] AI agents that use tools, make decisions, and complete multi-step tasks aren't prototypes anymore.",
            "url": "https://machinelearningmastery.com/agent-evaluation-how-to-test-and-measure-agentic-ai-performance/"
        },
        {
            "title": "How AI tools can redefine universal design to increase accessibility",
            "description": "[RESEARCH] Education Innovation",
            "url": "https://research.google/blog/how-ai-agents-can-redefine-universal-design-to-increase-accessibility/"
        },
        {
            "title": "RL without TD learning",
            "description": "[BAIR] In this post, I’ll introduce a reinforcement learning (RL) algorithm based on an “alternative” paradigm: divide and conquer. Unlike traditional methods, this algorithm is not based on temporal...",
            "url": "http://bair.berkeley.edu/blog/2025/11/01/rl-without-td-learning/"
        },
        {
            "title": "How AI trained on birds is surfacing underwater mysteries",
            "description": "[RESEARCH] Climate & Sustainability",
            "url": "https://research.google/blog/how-ai-trained-on-birds-is-surfacing-underwater-mysteries/"
        },
        {
            "title": "A Beginner’s Reading List for Large Language Models for 2026",
            "description": "[MACHINELEARNINGMASTERY] &nbsp; The large language models (LLMs) hype wave shows no sign of fading anytime soon: after all, LLMs keep reinventing themselves at a rapid pace and transforming the industry as a whole.",
            "url": "https://machinelearningmastery.com/a-beginners-reading-list-for-large-language-models-for-2026/"
        },
        {
            "title": "What exactly does word2vec learn?",
            "description": "[BAIR] What exactly does word2vec learn, and how? Answering this question amounts to understanding representation learning in a minimal yet interesting language modeling task. Despite the fact that word2vec...",
            "url": "http://bair.berkeley.edu/blog/2025/09/01/qwem-word2vec-theory/"
        },
        {
            "title": "Defending against Prompt Injection with Structured Queries (StruQ) and Preference Optimization (SecAlign)",
            "description": "[BAIR] Recent advances in Large Language Models (LLMs) enable exciting LLM-integrated applications. However, as LLMs have improved, so have the attacks against them. Prompt injection attack is listed as the...",
            "url": "http://bair.berkeley.edu/blog/2025/04/11/prompt-injection-defense/"
        },
        {
            "title": "From healthcare to road safety: How India is introducing AI into everyday living",
            "description": "[FIRSTPOST] India is integrating artificial intelligence (AI) into everyday lives by bringing tools in healthcare, education and even road safety. As New Delhi hosts the AI Impact Summit 2026, we explore how the...",
            "url": "https://www.firstpost.com/explainers/india-ai-healthcare-road-safety-education-13981287.html"
        },
        {
            "title": "Data is the ‘beacon of truth’: AI leaders flag governance, localisation as India’s defining challenge",
            "description": "[FIRSTPOST] As India accelerates its artificial intelligence ambitions, industry leaders are warning that the country’s long-term competitiveness will depend less on flashy models and more on the integrity of...",
            "url": "https://www.firstpost.com/business/data-the-beacon-of-truth-ai-leaders-flag-governance-localisation-india-defining-challenge-13981174.html"
        },
        {
            "title": "US Business Spending Surge Indicates Economic Resilience",
            "description": "[DEVDISCOURSE] U.S. business spending on capital goods rose significantly in December, driven by growth in the artificial intelligence sector. Despite tariffs hindering non-AI manufacturing, the sector is...",
            "url": "https://www.devdiscourse.com/article/law-order/3809516-us-business-spending-surge-indicates-economic-resilience"
        },
        {
            "title": "India has the talent, data and policy edge to lead in AI: Industry leaders",
            "description": "[CNBC TV18] Archana Vemulapalli, VP - Global Sales at AMD said India must move from being only a source of human intelligence to becoming a hub for artificial intelligence infrastructure as well. She stressed...",
            "url": "https://www.cnbctv18.com/technology/india-has-the-talent-data-and-policy-edge-to-lead-in-ai-industry-leaders-19853115.htm"
        },
        {
            "title": "No place for Sanju even in a dead rubber against the Dutch, India to bat first",
            "description": "[MALAYALA MANORAMA] India opted to bat against the Netherlands in their final Group A match in the T20 World Cup..India Netherlands T20 World Cup, India playing XI Netherlands, Abhishek Sharma batting order, Ishan...",
            "url": "https://www.onmanorama.com/sports/cricket/2026/02/18/t20-world-cup-2026-india-vs-netherlands-live.html"
        },
        {
            "title": "Google’s Sundar Pichai says India poised for “extraordinary trajectory” in AI as it unveils new initiatives",
            "description": "[BUSINESS TODAY] During a panel discussion, Pichai said India could become a “full-stack player” in artificial intelligence.",
            "url": "https://www.businesstoday.in/tech-today/story/googles-sundar-pichai-says-india-poised-for-extraordinary-trajectory-in-ai-as-it-unveils-new-initiatives-516797-2026-02-18"
        },
        {
            "title": "AI Revolutionizes Loan Disbursement and Banking Efficiency",
            "description": "[DEVDISCOURSE] Artificial Intelligence is dramatically reducing the time needed to process loans for MSMEs and saving significant work hours for banking professionals. BUSINESSNEXT, co-founded by Nishant Singh, is...",
            "url": "https://www.devdiscourse.com/article/technology/3809472-ai-revolutionizes-loan-disbursement-and-banking-efficiency"
        },
        {
            "title": "Machine learning algorithm predicts XRP price for March 1, 2026",
            "description": "[FINBOLD] XRP price is riding a wave of renewed altcoin momentum, and machine learning algorithms suggests further upside potential by March.",
            "url": "https://finbold.com/machine-learning-algorithm-predicts-xrp-price-for-march-1-2026/"
        },
        {
            "title": "\"Namaste, India!\": Brazilian President Lula after his arrival in India",
            "description": "[THE ECONOMIC TIMES] In a post on X after landing in India, President Lula said, \"Namaste, India! I've arrived for another visit with an important agenda: strengthening ties, deepening partnerships, and discussing the...",
            "url": "https://economictimes.indiatimes.com/news/india/namaste-india-brazilian-president-lula-after-his-arrival-in-india/articleshow/128509522.cms"
        },
        {
            "title": "A robotic dog made in China gets an Indian university kicked out of an AI summit",
            "description": "[THE ATLANTA JOURNAL-CONSTITUTION] A private Indian university has been booted from a top artificial intelligence summit in New Delhi after one of its staffers displayed a a commercially available robotic dog made in China, claiming...",
            "url": "https://www.ajc.com/news/2026/02/a-robotic-dog-made-in-china-gets-an-indian-university-kicked-out-of-an-ai-summit/"
        }
    ]
}